-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: localhost    Database: archive_job
-- ------------------------------------------------------
-- Server version	5.7.19-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `city`
--

DROP TABLE IF EXISTS `city`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `city` (
  `city` varchar(10) NOT NULL,
  `provience` varchar(10) NOT NULL,
  PRIMARY KEY (`city`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `city`
--

LOCK TABLES `city` WRITE;
/*!40000 ALTER TABLE `city` DISABLE KEYS */;
INSERT INTO `city` VALUES ('七台河','黑龙江'),('上海','上海'),('东莞','广东'),('东营','山东'),('中山','广东'),('临沂','山东'),('丹东','辽宁'),('乌海','内蒙古'),('乌鲁木齐','新疆'),('乐山','四川'),('九江','江西'),('伊春','黑龙江'),('佛山','广东'),('佳木斯','黑龙江'),('保定','河北'),('克拉玛依','新疆'),('六盘水','贵州'),('兰州','甘肃'),('内江','四川'),('北京','北京'),('十堰','湖北'),('南京','江苏'),('南充','四川'),('南宁','广西'),('南平','福建'),('南昌','江西'),('南通','江苏'),('南阳','河南'),('厦门','福建'),('双鸭山','黑龙江'),('台州','浙江'),('合肥','安徽'),('吉林','吉林'),('呼和浩特','内蒙古'),('咸阳','陕西'),('哈尔滨','黑龙江'),('唐山','河北'),('商丘','河南'),('嘉兴','浙江'),('四平','吉林'),('大同','山西'),('大庆','黑龙江'),('大连','辽宁'),('天水','甘肃'),('天津','天津'),('太原','山西'),('威海','山东'),('孝感','湖北'),('宁波','浙江'),('安庆','安徽'),('安阳','河南'),('宜宾','四川'),('宜昌','湖北'),('宝鸡','陕西'),('岳阳','湖南'),('常州','江苏'),('常德','湖南'),('平顶山','河南'),('广元','四川'),('广州','广东'),('廊坊','河北'),('开封','河南'),('张家口','河北'),('徐州','江苏'),('德州','山东'),('德阳','四川'),('怀化','湖南'),('惠州','广东'),('成都','四川'),('扬州','江苏'),('承德','河北'),('抚顺','辽宁'),('攀枝花','四川'),('新乡','河南'),('新余','江西'),('无锡','江苏'),('日照','山东'),('昆明','云南'),('景德镇','江西'),('曲靖','云南'),('朝阳','辽宁'),('本溪','辽宁'),('杭州','浙江'),('松原','吉林'),('枣庄','山东'),('柳州','广西'),('株洲','湖南'),('桂林','广西'),('梅州','广东'),('梧州','广西'),('武汉','湖北'),('永州','湖南'),('汉中','陕西'),('汕头','广东'),('江门','广东'),('沈阳','辽宁'),('沧州','河北'),('泉州','福建'),('泰安','山东'),('泰州','江苏'),('泸州','四川'),('洛阳','河南'),('济南','山东'),('济宁','山东'),('海口','海南'),('淄博','山东'),('淮北','安徽'),('淮南','安徽'),('淮阴','江苏'),('深圳','广东'),('温州','浙江'),('湖州','浙江'),('湘潭','湖南'),('湛江','广东'),('漯河','河南'),('漳州','福建'),('潍坊','山东'),('潮州','广东'),('濮阳','河南'),('烟台','山东'),('焦作','河南'),('牡丹江','黑龙江'),('珠海','广东'),('白城','吉林'),('白山','吉林'),('白银','甘肃'),('益阳','湖南'),('盐城','江苏'),('盘锦','辽宁'),('石嘴山','宁夏'),('石家庄','河北'),('福州','福建'),('秦皇岛','河北'),('绍兴','浙江'),('绵阳','四川'),('肇庆','广东'),('自贡','四川'),('芜湖','安徽'),('苏州','江苏'),('茂名','广东'),('荆州','湖北'),('荆门','湖北'),('莱芜','山东'),('萍乡','江西'),('营口','辽宁'),('葫芦岛','辽宁'),('蚌埠','安徽'),('衡水','河北'),('衡阳','湖南'),('襄樊','湖北'),('西宁','青海'),('西安','陕西'),('许昌','河南'),('贵港','广西'),('贵阳','贵州'),('赤峰','内蒙古'),('辽源','吉林'),('辽阳','辽宁'),('连云港','江苏'),('通化','吉林'),('遂宁','四川'),('遵义','贵州'),('邢台','河北'),('邯郸','河北'),('邵阳','湖南'),('郑州','河南'),('郴州','湖南'),('鄂州','湖北'),('重庆','重庆'),('铁岭','辽宁'),('铜川','陕西'),('铜陵','安徽'),('银川','宁夏'),('锦州','辽宁'),('镇江','江苏'),('长春','吉林'),('长沙','湖南'),('长治','山西'),('阜新','辽宁'),('阜阳','安徽'),('阳江','广东'),('阳泉','山西'),('青岛','山东'),('鞍山','辽宁'),('韶关','广东'),('马鞍山','安徽'),('鸡西','黑龙江'),('鹤壁','河南'),('鹤岗','黑龙江'),('黄冈','湖北'),('黄石','湖北'),('齐齐哈尔','黑龙江'),('龙岩','福建');
/*!40000 ALTER TABLE `city` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-03-05 23:04:22
